wisteria-1c/Конфигурация/Catalogs/ИмпортируемаяПартияСАТУРН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИмпортируемаяПартияСАТУРН</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбъектовСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВвоза</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияСАТУРН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХраненияСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маркировка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаСАТУРН</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторАРГУС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаСАТУРН</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТНАРГУС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаСАТУРН</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОтправителяАРГУС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПредприятияРастаможиванияАРГУС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяЗагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаЭкспортер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТранспортногоСредства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТранспортныхСредствСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаможенныйПункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТаможенныхПунктовСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерриториальноеУправление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТерриториальныхУправленийСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходногоДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаСАТУРН</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсходногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПАТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторПАТСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУпаковочнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиЕдиницИзмеренияСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКоличествоВУпаковкеСАТУРН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификаторПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаСАТУРН</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПАТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторПАТСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковочнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиЕдиницИзмеренияСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмеряемойВеличиныСАТУРН</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыИзмеряемыхВеличинСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВУпаковкеСАТУРН</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоВУпаковкеСАТУРН</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаСАТУРН</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/КлассификаторОрганизацийСАТУРН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КлассификаторОрганизацийСАТУРН</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбъектовСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентГосИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяЗагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РолиКонтрагентовСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МестаХранения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХраненияСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговыйОбъект</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектСАТУРН</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроизводственныйОбъект</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПроизводственныйОбъектИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МестаПрименения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоПрименения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаПримененияСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ИмпортируемаяПартияСАТУРН/Forms/ДанныеКлассификатора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбработатьПереданныеПараметры(Отказ);
	УправлениеЭлементамиФормы();
	СтандартныеПодсистемыСервер.СброситьРазмерыИПоложениеОкна(ЭтотОбъект);
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИнформацияСостояниеЗагрузкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьИмпортируемуюПартию" Тогда
		ПоказатьЗначение(, ИмпортируемаяПартия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьОрганизацию" Тогда
		ПоказатьЗначение(, ОрганизацияСАТУРН);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ЗагрузитьОрганизацию" Тогда
		
		ОповещениеПослеВопроса = Новый ОписаниеОповещения("ПослеЗагрузкиОрганизации", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Загрузить владельца импортируемой партии?'");
		
		ПоказатьВопрос(ОповещениеПослеВопроса, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеМестаХраненияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьМестоХранения" Тогда
		ПоказатьЗначение(, МестоХранения);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ЗагрузитьМестоХранения" Тогда
		
		ОповещениеПослеВопроса = Новый ОписаниеОповещения("ПослеЗагрузкиМестаХранения", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Загрузить место хранения импортируемой партии?'");
		
		ПоказатьВопрос(ОповещениеПослеВопроса, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеСтраныОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСтрану" Тогда
		ПоказатьЗначение(, Страна);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ЗагрузитьСтрану" Тогда
		
		ОповещениеПослеВопроса = Новый ОписаниеОповещения("ПослеЗагрузкиСтраны", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Загрузить страну-импортера импортируемой партии?'");
		
		ПоказатьВопрос(ОповещениеПослеВопроса, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеТаможенногоПунктаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьТаможенныйПункт" Тогда
		ПоказатьЗначение(, ТаможенныйПункт);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ЗагрузитьТаможенныйПункт" Тогда
		
		ОповещениеПослеВопроса = Новый ОписаниеОповещения("ПослеЗагрузкиТаможенногоПункта", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Загрузить пункт растаможивания импортируемой партии?'");
		
		ПоказатьВопрос(ОповещениеПослеВопроса, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеТерриториальногоУправленияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьТерриториальноеУправление" Тогда
		ПоказатьЗначение(, ТерриториальноеУправление);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ЗагрузитьТерриториальноеУправление" Тогда
		
		ОповещениеПослеВопроса = Новый ОписаниеОповещения("ПослеЗагрузкиТерриториальногоУправления", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Загрузить территориальное управление импортируемой партии?'");
		
		ПоказатьВопрос(ОповещениеПослеВопроса, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеТипаТранспортногоСредстваОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьТранспортноеСредство" Тогда
		ПоказатьЗначение(, ТранспортноеСредство);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ЗагрузитьТранспортноеСредство" Тогда
		
		ОповещениеПослеВопроса = Новый ОписаниеОповещения("ПослеЗагрузкиТранспортногоСредства", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Загрузить транспортное средство импортируемой партии?'");
		
		ПоказатьВопрос(ОповещениеПослеВопроса, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Поле.Имя = Элементы.ТоварыПредставлениеПАТ.Имя Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ПАТ) Тогда
		ПоказатьЗначение(, ТекущиеДанные.ПАТ);
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторПА) Тогда
		
		ДополнительныеПараметры = Новый Структура("ИдентификаторПА, ИдентификаторСтроки",
			ТекущиеДанные.ИдентификаторПА, ТекущиеДанные.ПолучитьИдентификатор());
		
		ОповещениеПослеВопроса = Новый ОписаниеОповещения("ПослеЗагрузкиПАТ", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = НСтр("ru = 'Загрузить ПАТ?'");
		
		ПоказатьВопрос(ОповещениеПослеВопроса, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	ЗагрузитьИмпортируемуюПартию_ДлительнаяОперация();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьИмпортируемуюПартию_ДлительнаяОперация()
	
	ПараметрыОбработкиДокументов = ИнтеграцияСАТУРНСлужебныйКлиентСервер.ПараметрыОбработкиДокументов();
	ПараметрыОбработкиДокументов.Ссылка             = ПредопределенноеЗначение("Справочник.ИмпортируемаяПартияСАТУРН.ПустаяСсылка");
	ПараметрыОбработкиДокументов.ДальнейшееДействие = ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюСАТУРН.ЗагрузитеКлассификатор");
	
	ПараметрыОбработкиДокументов.ДополнительныеПараметры = Новый Структура();
	ПараметрыОбработкиДокументов.ДополнительныеПараметры.Вставить("Идентификатор", Идентификатор);
	
	ОписаниеПриЗавершении = Новый ОписаниеОповещения(
		"Подключаемый_ПриЗавершенииОперации", ЭтотОбъект, ПараметрыОбработкиДокументов);
	
	ИнтеграцияСАТУРНКлиент.ПодготовитьКПередаче(
		ЭтотОбъект,
		ПараметрыОбработкиДокументов,
		ОписаниеПриЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриЗавершенииОперации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементДанных Из Результат Цикл
		
		Если ЗначениеЗаполнено(ЭлементДанных.ТекстОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ЭлементДанных.ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		Для Каждого ОбъектЗагрузки Из ЭлементДанных.Объект Цикл
			
			Если Не ТипЗнч(ОбъектЗагрузки) = Тип("СправочникСсылка.ИмпортируемаяПартияСАТУРН") Тогда
				Продолжить;
			КонецЕсли;
			
			ИмпортируемаяПартия = ОбъектЗагрузки;
			Прервать;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ИмпортируемаяПартия) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗаголовка = НСтр("ru = 'Загрузка из классификатора'");
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Выполнена загрузка импортируемой партии %1.'"), ИмпортируемаяПартия);
	ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстСообщения, БиблиотекаКартинок.Информация32ГосИС);
	
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(ИмпортируемаяПартия);
	
	Закрыть(МестоХранения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиОрганизации(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьОрганизациюНаСервере();
	
	Если ЗначениеЗаполнено(ОрганизацияСАТУРН) Тогда
		
		ПараметрОповещения = ОрганизацияСАТУРН;
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(ОрганизацияСАТУРН, ПараметрОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОрганизациюНаСервере()
	
	Если Не ЗначениеЗаполнено(ИдентификаторОрганизации) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполненияЗапроса = ИнтерфейсСАТУРНВызовСервера.ОрганизацияПоИдентификатору(ИдентификаторОрганизации);
	
	Если Не ПустаяСтрока(РезультатВыполненияЗапроса.ТекстОшибки) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(РезультатВыполненияЗапроса.ТекстОшибки);
		
	Иначе
		
		ДанныеОрганизации = ИнтерфейсСАТУРН.ДанныеОрганизации(РезультатВыполненияЗапроса.Элемент);
		ОрганизацияСАТУРН = ИнтеграцияСАТУРН.ЗагрузитьОрганизацию(ДанныеОрганизации);
		
	КонецЕсли;
	
	УстановитьОтображениеОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиМестаХранения(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьМестоХраненияНаСервере();
	
	Если ЗначениеЗаполнено(МестоХранения) Тогда
		
		ПараметрОповещения = МестоХранения;
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(МестоХранения, ПараметрОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьМестоХраненияНаСервере()
	
	Если Не ЗначениеЗаполнено(ИдентификаторМестаХранения) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполненияЗапроса = ИнтерфейсСАТУРНВызовСервера.МестоХраненияПоИдентификатору(ИдентификаторМестаХранения);
	
	Если Не ПустаяСтрока(РезультатВыполненияЗапроса.ТекстОшибки) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(РезультатВыполненияЗапроса.ТекстОшибки);
		
	Иначе
		
		ДанныеМестаХранения = ИнтерфейсСАТУРН.ДанныеМестаХранения(РезультатВыполненияЗапроса.Элемент);
		МестоХранения       = ИнтеграцияСАТУРН.ЗагрузитьМестоХранения(ДанныеМестаХранения);
		
	КонецЕсли;
	
	УстановитьОтображениеМестаХранения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиСтраны(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьСтрануНаСервере();
	
	Если ЗначениеЗаполнено(Страна) Тогда
		
		ПараметрОповещения = Страна;
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Страна, ПараметрОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСтрануНаСервере()
	
	Если Не ЗначениеЗаполнено(ИдентификаторСтраныЭкспортера) Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ИнтерфейсСАТУРНВызовСервера.СписокКлассификаторовСтран();
	
	Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(Результат.ТекстОшибки);
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОбмена = ИнтеграцияСАТУРН.ПараметрыОбмена();
	
	ИнтеграцияСАТУРН.ЗагрузитьДанныеКлассификатора(Результат.Список, Метаданные.Справочники.КлассификаторСтранСАТУРН);
	Страна = Справочники.КлассификаторСтранСАТУРН.КлассификаторСтраны(ИдентификаторСтраныЭкспортера, ПараметрыОбмена);
	
	УстановитьОтображениеСтраны();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиТаможенногоПункта(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьТаможенныйПунктНаСервере();
	
	Если ЗначениеЗаполнено(ТаможенныйПункт) Тогда
		
		ПараметрОповещения = ТаможенныйПункт;
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(ТаможенныйПункт, ПараметрОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаможенныйПунктНаСервере()
	
	Если Не ЗначениеЗаполнено(ИдентификаторТаможенногоПункта) Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ИнтерфейсСАТУРНВызовСервера.СписокКлассификаторовТаможенныхПунктов();
	
	Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(Результат.ТекстОшибки);
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОбмена = ИнтеграцияСАТУРН.ПараметрыОбмена();
	
	ИнтеграцияСАТУРН.ЗагрузитьДанныеКлассификатора(Результат.Список, Метаданные.Справочники.КлассификаторТаможенныхПунктовСАТУРН);
	ТаможенныйПункт = Справочники.КлассификаторТаможенныхПунктовСАТУРН.КлассификаторТаможенногоПункта(ИдентификаторТерриториальногоУправления, ПараметрыОбмена);
	
	УстановитьОтображениеТаможенногоПункта();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиТерриториальногоУправления(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьТерриториальноеУправлениеНаСервере();
	
	Если ЗначениеЗаполнено(ТерриториальноеУправление) Тогда
		
		ПараметрОповещения = ТерриториальноеУправление;
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(ТерриториальноеУправление, ПараметрОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТерриториальноеУправлениеНаСервере()
	
	Если Не ЗначениеЗаполнено(ИдентификаторТерриториальногоУправления) Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ИнтерфейсСАТУРНВызовСервера.СписокКлассификаторовТерриториальныхУправлений();
	
	Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(Результат.ТекстОшибки);
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОбмена = ИнтеграцияСАТУРН.ПараметрыОбмена();
	
	ИнтеграцияСАТУРН.ЗагрузитьДанныеКлассификатора(Результат.Список, Метаданные.Справочники.КлассификаторТерриториальныхУправленийСАТУРН);
	ТерриториальноеУправление = Справочники.КлассификаторТерриториальныхУправленийСАТУРН.КлассификаторТУ(ИдентификаторТерриториальногоУправления, ПараметрыОбмена);
	
	УстановитьОтображениеТерриториальногоУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиТранспортногоСредства(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьТранспортноеСредствоНаСервере();
	
	Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда
		
		ПараметрОповещения = ТранспортноеСредство;
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(ТранспортноеСредство, ПараметрОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТранспортноеСредствоНаСервере()
	
	Если Не ЗначениеЗаполнено(ИдентификаторТипаТранспортногоСредстваПеревозчика) Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ИнтерфейсСАТУРНВызовСервера.СписокКлассификаторовТранспортныхСредств();
	
	Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(Результат.ТекстОшибки);
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОбмена = ИнтеграцияСАТУРН.ПараметрыОбмена();
	
	ИнтеграцияСАТУРН.ЗагрузитьДанныеКлассификатора(Результат.Список, Метаданные.Справочники.КлассификаторТранспортныхСредствСАТУРН);
	ТранспортноеСредство = Справочники.КлассификаторТранспортныхСредствСАТУРН.КлассификаторТС(ИдентификаторТипаТранспортногоСредстваПеревозчика, ПараметрыОбмена);
	
	УстановитьОтображениеТранспортногоСредства();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиПАТ(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ПАТ = ЗагрузитьПАТНаСервере(ДополнительныеПараметры.ИдентификаторПА, ДополнительныеПараметры.ИдентификаторСтроки);
	
	Если ЗначениеЗаполнено(ПАТ) Тогда
		
		ПараметрОповещения = ПАТ;
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(ПАТ, ПараметрОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьПАТНаСервере(ИдентификаторПАТ, ИдентификаторСтроки)
	
	Если Не ЗначениеЗаполнено(ИдентификаторПАТ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РезультатВыполненияЗапроса = ИнтерфейсСАТУРНВызовСервера.ПАТПоИдентификатору(ИдентификаторПАТ);
	
	Если Не ПустаяСтрока(РезультатВыполненияЗапроса.ТекстОшибки) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(РезультатВыполненияЗапроса.ТекстОшибки);
		
	Иначе
		
		ДанныеПАТ = ИнтерфейсСАТУРН.ДанныеПАТ(РезультатВыполненияЗапроса.Элемент);
		ПАТ = ИнтеграцияСАТУРН.ЗагрузитьПАТ(ДанныеПАТ);
		
	КонецЕсли;
	
	СтрокаТоваров = Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если СтрокаТоваров <> Неопределено Тогда
		СтрокаТоваров.ПАТ = ПАТ;
	КонецЕсли;
	
	УстановитьОтображениеПАТ(ИдентификаторСтроки);
	
КонецФункции

&НаСервере
Процедура ОбработатьПереданныеПараметры(Отказ)

	Если Не ЗначениеЗаполнено(Параметры.Идентификатор) Тогда
		ВызватьИсключение НСтр("ru = 'Форма не предназначена для открытия без передачи в неё идентификатора импортируемой партии.'");
	Иначе
		
		Идентификатор = Параметры.Идентификатор;
		НеПоказыватьСостояниеЗагрузки = Параметры.НеПоказыватьСостояниеЗагрузки;
		Результат = ИнтерфейсСАТУРНВызовСервера.ИмпортируемаяПартияПоИдентификатору(Идентификатор);
		
		Если Не ПустаяСтрока(Результат.ТекстОшибки) Тогда
			
			ЕстьОшибка  = Истина;
			
			Строки = Новый Массив;
			Строки.Добавить(
				Новый ФорматированнаяСтрока(
				НСтр("ru = 'Ошибка:'")));
			Строки.Добавить(" ");
			Если ОбщегоНазначенияИСКлиентСерверПовтИсп.ЭтоИнтерфейс85() Тогда
				Строки.Добавить(Новый ФорматированнаяСтрока(Результат.ТекстОшибки));
			Иначе
				Строки.Добавить(Новый ФорматированнаяСтрока(Результат.ТекстОшибки,, ЦветаСтиля.ЦветТекстаПроблемаГосИС));
			КонецЕсли;
			
			ТекстОшибки = Новый ФорматированнаяСтрока(Строки);
			Элементы.ФормаЗагрузить.Доступность = Ложь;
			
		Иначе
			
			ЕстьОшибка  = Ложь;
			ДанныеИмпортируемойПартии = ИнтерфейсСАТУРН.ДанныеИмпортируемойПартии(Результат.Элемент);
			АдресХраненияПараметрыОбмена = ПоместитьВоВременноеХранилище(Результат.ПараметрыОбмена, УникальныйИдентификатор);
			
			ЗаполнитьДанныеИмпортируемойПартии(ДанныеИмпортируемойПартии);
			Элементы.ФормаЗагрузить.Доступность = Истина;
			
			ОпределитьНаличиеВИБ();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьНаличиеВИБ()
	
	СписокЗапросов = Новый СписокЗначений;
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ИмпортируемаяПартияСАТУРН.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИмпортируемаяПартияСАТУРН КАК ИмпортируемаяПартияСАТУРН
	|ГДЕ
	|	ИмпортируемаяПартияСАТУРН.Идентификатор = &Идентификатор",
	"ИмпортируемаяПартияСАТУРН");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	КлассификаторОрганизацийСАТУРН.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлассификаторОрганизацийСАТУРН КАК КлассификаторОрганизацийСАТУРН
	|ГДЕ
	|	КлассификаторОрганизацийСАТУРН.Идентификатор = &ИдентификаторОрганизации",
	"КлассификаторОрганизацийСАТУРН");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	МестаХраненияСАТУРН.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.МестаХраненияСАТУРН КАК МестаХраненияСАТУРН
	|ГДЕ
	|	МестаХраненияСАТУРН.Идентификатор = &ИдентификаторМестаХранения",
	"МестаХраненияСАТУРН");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	КлассификаторСтранСАТУРН.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлассификаторСтранСАТУРН КАК КлассификаторСтранСАТУРН
	|ГДЕ
	|	КлассификаторСтранСАТУРН.Идентификатор = &ИдентификаторСтраныЭкспортера",
	"КлассификаторСтранСАТУРН");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	КлассификаторТаможенныхПунктовСАТУРН.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлассификаторТаможенныхПунктовСАТУРН КАК КлассификаторТаможенныхПунктовСАТУРН
	|ГДЕ
	|	КлассификаторТаможенныхПунктовСАТУРН.Идентификатор = &ИдентификаторТаможенногоПункта",
	"КлассификаторТаможенныхПунктовСАТУРН");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	КлассификаторТерриториальныхУправленийСАТУРН.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлассификаторТерриториальныхУправленийСАТУРН КАК КлассификаторТерриториальныхУправленийСАТУРН
	|ГДЕ
	|	КлассификаторТерриториальныхУправленийСАТУРН.Идентификатор = &ИдентификаторТерриториальногоУправления",
	"КлассификаторТерриториальныхУправленийСАТУРН");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	КлассификаторТранспортныхСредствСАТУРН.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлассификаторТранспортныхСредствСАТУРН КАК КлассификаторТранспортныхСредствСАТУРН
	|ГДЕ
	|	КлассификаторТранспортныхСредствСАТУРН.Идентификатор = &ИдентификаторТипаТранспортногоСредстваПеревозчика",
	"КлассификаторТранспортныхСредствСАТУРН");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	КлассификаторПАТСАТУРН.Ссылка        КАК Ссылка,
	|	КлассификаторПАТСАТУРН.Идентификатор КАК Идентификатор
	|ИЗ
	|	Справочник.КлассификаторПАТСАТУРН КАК КлассификаторПАТСАТУРН
	|ГДЕ
	|	КлассификаторПАТСАТУРН.Идентификатор В (&ИдентификаторыПА)",
	"ИдентификаторыПА");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("ИдентификаторОрганизации", ИдентификаторОрганизации);
	Запрос.УстановитьПараметр("ИдентификаторМестаХранения", ИдентификаторМестаХранения);
	Запрос.УстановитьПараметр("ИдентификаторСтраныЭкспортера", ИдентификаторСтраныЭкспортера);
	Запрос.УстановитьПараметр("ИдентификаторТаможенногоПункта", ИдентификаторТаможенногоПункта);
	Запрос.УстановитьПараметр("ИдентификаторТерриториальногоУправления", ИдентификаторТерриториальногоУправления);
	Запрос.УстановитьПараметр("ИдентификаторТипаТранспортногоСредстваПеревозчика", ИдентификаторТипаТранспортногоСредстваПеревозчика);
	Запрос.УстановитьПараметр("ИдентификаторыПА", ОбщегоНазначения.ВыгрузитьКолонку(Товары, "ИдентификаторПА", Истина));
	
	РезультатЗапроса = ОбщегоНазначенияИС.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
	
	ВыборкаИмпортируемаяПартияСАТУРН                    = РезультатЗапроса["ИмпортируемаяПартияСАТУРН"].Выбрать();
	ВыборкаКлассификаторОрганизацийСАТУРН               = РезультатЗапроса["КлассификаторОрганизацийСАТУРН"].Выбрать();
	ВыборкаМестаХраненияСАТУРН                          = РезультатЗапроса["МестаХраненияСАТУРН"].Выбрать();
	ВыборкаКлассификаторСтранСАТУРН                     = РезультатЗапроса["КлассификаторСтранСАТУРН"].Выбрать();
	ВыборкаКлассификаторТаможенныхПунктовСАТУРН         = РезультатЗапроса["КлассификаторТаможенныхПунктовСАТУРН"].Выбрать();
	ВыборкаКлассификаторТерриториальныхУправленийСАТУРН = РезультатЗапроса["КлассификаторТерриториальныхУправленийСАТУРН"].Выбрать();
	ВыборкаКлассификаторТранспортныхСредствСАТУРН       = РезультатЗапроса["КлассификаторТранспортныхСредствСАТУРН"].Выбрать();
	ВыборкаИдентификаторыПА                             = РезультатЗапроса["ИдентификаторыПА"].Выбрать();
	
	Если ВыборкаИмпортируемаяПартияСАТУРН.Следующий() Тогда
		
		ИмпортируемаяПартия = ВыборкаИмпортируемаяПартияСАТУРН.Ссылка;
		
		Строки = Новый Массив;
		Строки.Добавить(НСтр("ru = 'Импортируемая партия уже загружена'"));
		Строки.Добавить(" (");
		Строки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'открыть'"),,,, "ОткрытьИмпортируемуюПартию"));
		Строки.Добавить(").");
		
		ИнформацияСостояниеЗагрузки = Новый ФорматированнаяСтрока(Строки);
		
	КонецЕсли;
	
	Если ВыборкаКлассификаторОрганизацийСАТУРН.Следующий() Тогда
		ОрганизацияСАТУРН = ВыборкаКлассификаторОрганизацийСАТУРН.Ссылка;
	КонецЕсли;
	
	УстановитьОтображениеОрганизации();
	
	Если ВыборкаМестаХраненияСАТУРН.Следующий() Тогда
		МестоХранения = ВыборкаМестаХраненияСАТУРН.Ссылка;
	КонецЕсли;
	
	УстановитьОтображениеМестаХранения();
	
	Если ВыборкаКлассификаторСтранСАТУРН.Следующий() Тогда
		Страна = ВыборкаКлассификаторСтранСАТУРН.Ссылка;
	КонецЕсли;
	
	УстановитьОтображениеСтраны();
	
	Если ВыборкаКлассификаторТаможенныхПунктовСАТУРН.Следующий() Тогда
		ТаможенныйПункт = ВыборкаКлассификаторТаможенныхПунктовСАТУРН.Ссылка;
	КонецЕсли;
	
	УстановитьОтображениеТаможенногоПункта();
	
	Если ВыборкаКлассификаторТерриториальныхУправленийСАТУРН.Следующий() Тогда
		ТерриториальноеУправление = ВыборкаКлассификаторТерриториальныхУправленийСАТУРН.Ссылка;
	КонецЕсли;
	
	УстановитьОтображениеТерриториальногоУправления();
	
	Если ВыборкаКлассификаторТранспортныхСредствСАТУРН.Следующий() Тогда
		ТранспортноеСредство = ВыборкаКлассификаторТранспортныхСредствСАТУРН.Ссылка;
	КонецЕсли;
	
	УстановитьОтображениеТранспортногоСредства();
	
	Пока ВыборкаИдентификаторыПА.Следующий() Цикл
		
		ПараметрыПоиска = Новый Структура("ИдентификаторПА", ВыборкаИдентификаторыПА.Идентификатор);
		СтрокиТоваров = Товары.НайтиСтроки(ПараметрыПоиска);
		
		Для Каждого СтрокаТоваров Из СтрокиТоваров Цикл
			СтрокаТоваров.ПАТ = ВыборкаИдентификаторыПА.Ссылка;
		КонецЦикла;
		
	КонецЦикла;
	
	УстановитьОтображениеПАТ();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеИмпортируемойПартии(ДанныеИмпортируемойПартии)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеИмпортируемойПартии,, "Товары");
	
	Товары.Очистить();
	
	Для Каждого СтрокаТоваров Из ДанныеИмпортируемойПартии.Товары Цикл
		
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
		
		Если Не НоваяСтрока.КоличествоВУпаковкеСАТУРН = 0 Тогда
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество / НоваяСтрока.КоличествоВУпаковкеСАТУРН;
		КонецЕсли;
		
		НоваяСтрока.ПредставлениеУпаковочнойЕдиницы = СтрокаТоваров.Упаковка.НаименованиеУпаковки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеОрганизации()
	
	Если ЗначениеЗаполнено(ОрганизацияСАТУРН) Тогда
		
		ОписаниеОрганизации = Новый ФорматированнаяСтрока(
			Строка(ОрганизацияСАТУРН),,,,
			"ОткрытьОрганизацию");
		
	ИначеЕсли ЗначениеЗаполнено(ИдентификаторОрганизации) Тогда
		
		ОписаниеОрганизации = Новый ФорматированнаяСтрока(
			НСтр("ru = '<не загружено>'"),,,,
			"ЗагрузитьОрганизацию");
		
	Иначе
		
		ОписаниеОрганизации = Новый ФорматированнаяСтрока(
			НСтр("ru = '<не указан>'"),,
			ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеМестаХранения()
	
	Если ЗначениеЗаполнено(МестоХранения) Тогда
		
		ОписаниеМестаХранения = Новый ФорматированнаяСтрока(
			Строка(МестоХранения),,,,
			"ОткрытьМестоХранения");
		
	ИначеЕсли ЗначениеЗаполнено(ИдентификаторМестаХранения) Тогда
		
		ОписаниеМестаХранения = Новый ФорматированнаяСтрока(
			НСтр("ru = '<не загружено>'"),,,,
			"ЗагрузитьМестоХранения");
		
	Иначе
		
		ОписаниеМестаХранения = Новый ФорматированнаяСтрока(
			НСтр("ru = '<не указан>'"),,
			ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеСтраны()
	
	Если ЗначениеЗаполнено(Страна) Тогда
		
		ОписаниеСтраны = Новый ФорматированнаяСтрока(
			Строка(Страна),,,,
			"ОткрытьСтрану");
		
	ИначеЕсли ЗначениеЗаполнено(ИдентификаторСтраныЭкспортера) Тогда
		
		ОписаниеСтраны = Новый ФорматированнаяСтрока(
			НСтр("ru = '<не загружено>'"),,,,
			"ЗагрузитьСтрану");
		
	Иначе
		
		ОписаниеСтраны = Новый ФорматированнаяСтрока(
			НСтр("ru = '<не указан>'"),,
			ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеТаможенногоПункта()
	
	Если ЗначениеЗаполнено(ТаможенныйПункт) Тогда
		
		ОписаниеТаможенногоПункта = Новый ФорматированнаяСтрока(
			Строка(ТаможенныйПункт),,,,
			"ОткрытьТаможенныйПункт");
		
	ИначеЕсли ЗначениеЗаполнено(ИдентификаторТаможенногоПункта) Тогда
		
		ОписаниеТаможенногоПункта = Новый ФорматированнаяСтрока(
			НСтр("ru = '<не загружено>'"),,,,
			"ЗагрузитьТаможенныйПункт");
		
	Иначе
		
		ОписаниеТаможенногоПункта = Новый ФорматированнаяСтрока(
			НСтр("ru = '<не указан>'"),,
			ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеТерриториальногоУправления()
	
	Если ЗначениеЗаполнено(ТерриториальноеУправление) Тогда
		
		ОписаниеТерриториальногоУправления = Новый ФорматированнаяСтрока(
			Строка(ТерриториальноеУправление),,,,
			"ОткрытьТерриториальноеУправление");
		
	ИначеЕсли ЗначениеЗаполнено(ИдентификаторТерриториальногоУправления) Тогда
		
		ОписаниеТерриториальногоУправления = Новый ФорматированнаяСтрока(
			НСтр("ru = '<не загружено>'"),,,,
			"ЗагрузитьТерриториальноеУправление");
		
	Иначе
		
		ОписаниеТерриториальногоУправления = Новый ФорматированнаяСтрока(
			НСтр("ru = '<не указан>'"),,
			ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеТранспортногоСредства()
	
	Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда
		
		ОписаниеТипаТранспортногоСредства = Новый ФорматированнаяСтрока(
			Строка(ТранспортноеСредство),,,,
			"ОткрытьТранспортноеСредство");
		
	ИначеЕсли ЗначениеЗаполнено(ИдентификаторТипаТранспортногоСредстваПеревозчика) Тогда
		
		ОписаниеТипаТранспортногоСредства = Новый ФорматированнаяСтрока(
			НСтр("ru = '<не загружено>'"),,,,
			"ЗагрузитьТранспортноеСредство");
		
	Иначе
		
		ОписаниеТипаТранспортногоСредства = Новый ФорматированнаяСтрока(
			НСтр("ru = '<не указан>'"),,
			ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеПАТ(ИдентификаторСтроки = Неопределено)
	
	Если ИдентификаторСтроки = Неопределено Тогда
		МассивСтрок = Товары;
	Иначе
		СтрокаТоваров = Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
		МассивСтрок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаТоваров);
	КонецЕсли;
	
	Для Каждого СтрокаТовары Из МассивСтрок Цикл
		
		Если ЗначениеЗаполнено(СтрокаТовары.ПАТ) Тогда
			
			СтрокаТовары.ПредставлениеПАТ = Строка(СтрокаТовары.ПАТ);
			
		ИначеЕсли ЗначениеЗаполнено(СтрокаТовары.ИдентификаторПА) Тогда
			
			СтрокаТовары.ПредставлениеПАТ = НСтр("ru = '<не загружено>'");
			
		Иначе
			
			СтрокаТовары.ПредставлениеПАТ = НСтр("ru = '<не указан>'");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияИСКлиентСерверПовтИсп.ЭтоИнтерфейс85();
	
	Если ЕстьОшибка Тогда
		
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОшибка;
		Элементы.ФормаОтмена.Видимость         = Ложь;
		Элементы.ФормаЗакрыть.Видимость        = Истина И Не ЭтоИнтерфейс85;
		Элементы.ФормаЗагрузить.Видимость      = Истина;
		
	Иначе

		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаДанныеКлассификатора;
		
		Если ЗначениеЗаполнено(ИмпортируемаяПартия) Тогда
			
			Если НеПоказыватьСостояниеЗагрузки Тогда
				Элементы.ИнформацияСостояниеЗагрузки.Видимость = Ложь;
			КонецЕсли;
			
			Элементы.ФормаОтмена.Видимость    = Ложь;
			Элементы.ФормаЗакрыть.Видимость   = Истина И Не ЭтоИнтерфейс85;
			Элементы.ФормаЗагрузить.Видимость = Ложь;
			
		Иначе
			
			Элементы.ИнформацияСостояниеЗагрузки.Видимость = Ложь;
			
			Элементы.ФормаОтмена.Видимость    = Истина И Не ЭтоИнтерфейс85;
			Элементы.ФормаЗакрыть.Видимость   = Ложь;
			Элементы.ФормаЗагрузить.Видимость = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОформляемыеГруппыФормы = ОбщегоНазначенияИС.НоваяСтруктураОформляемыхГруппФормы();
	ОформляемыеГруппыФормы.Ошибка         = "ГруппаОшибка";
	ОбщегоНазначенияИС.УстановитьОформлениеГруппФормы(ЭтотОбъект, ОформляемыеГруппыФормы);
	
КонецПроцедуры

#КонецОбласти
